NextFOAM-2509/tutorials/compressible/rhoPimpleFoam/RAS/angledDuctLTS/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity1
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        porosity;

        type            DarcyForchheimer;

        d   (5e7 -1000 -1000);
        f   (0 0 0);

        coordinateSystem
        {
            origin  (0 0 0);
            e1      (0.70710678 0.70710678 0);
            e2      (0 0 1);
        }
    }
}


// ************************************************************************* //
